иб/src/Catalogs/Заболевания/Заболевания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заболевания</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодНСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаразнаяСписок1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаразнаяСписок2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтиологияБолезни</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыБорьбы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереносчикиБолезни</name>
    <attributes>
      <name>Переносчик</name>
      <type>
        <types>CatalogRef.ПереносчикиБолезней</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоражаемыеСистемы</name>
    <attributes>
      <name>ПоражаемаяСистема</name>
      <type>
        <types>CatalogRef.ПоражаемыеСистемы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозбудителиБолезни</name>
    <attributes>
      <name>Возбудитель</name>
      <type>
        <types>CatalogRef.Возбудители</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Литература</name>
    <attributes>
      <name>Литература</name>
      <type>
        <types>CatalogRef.Литература</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВетеринарныеМероприятия</name>
    <attributes>
      <name>ВетеринарноеМероприятие</name>
      <type>
        <types>CatalogRef.ОздоровительныеМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрименениеВетПрепаратов</name>
    <attributes>
      <name>ВетеринарныйПрепарат</name>
      <type>
        <types>CatalogRef.Препараты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаКг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьПрименения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПризнакиБолезни</name>
    <attributes>
      <name>Признак</name>
      <type>
        <types>CatalogRef.ПризнакиБолезней</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

иб/src/Catalogs/Заболевания/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Признаки.ЗагрузитьЗначения(Параметры.ПризнакиБолезни);
	
	//Список.Отбор.Элементы.Очистить();
	//Если ЗначениеЗаполнено(Признаки)  Тогда
	//	ОтборВ = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ОтборВ.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Признак");
	//	ОтборВ.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//	ОтборВ.ПравоеЗначение = Параметры.ПризнакиБолезни;
	//	ОтборВ.Использование = Истина;
	//КонецЕсли;
	//УстановленОтбор = Истина;
	//Список.Группировка.Элементы.Очистить();
	//ЭлементГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	//ЭлементГруппировки.Использование = Истина;
	//ЭлементГруппировки.Поле = Новый ПолеКомпоновкиДанных("Наименование");		
	//УстановитьВидимостьОтбора();

	Если Параметры.ПризнакиБолезни.Количество()>0 тогда
		Элементы.ТаблицаБолезней.Видимость = Истина;
		Элементы.Список.Видимость = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заболевания.Ссылка КАК Ссылка,
	|	Заболевания.Наименование,
	|	сжсвЗаболеванияПризнакиБолезни.Признак,
	|	ВложенныйЗапрос.Признак КАК КоличествоПодх
	|ПОМЕСТИТЬ Основной
	|ИЗ
	|	Справочник.Заболевания КАК Заболевания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заболевания.ПризнакиБолезни КАК сжсвЗаболеванияПризнакиБолезни
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Заболевания.Ссылка КАК Ссылка,
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ сжсвЗаболеванияПризнакиБолезни.Признак) КАК Признак
	|			ИЗ
	|				Справочник.Заболевания КАК Заболевания
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заболевания.ПризнакиБолезни КАК сжсвЗаболеванияПризнакиБолезни
	|					ПО (ВЫБОР
	|							КОГДА сжсвЗаболеванияПризнакиБолезни.Ссылка ЕСТЬ NULL 
	|								ТОГДА 1 = 1
	|							ИНАЧЕ сжсвЗаболеванияПризнакиБолезни.Ссылка = Заболевания.Ссылка
	|						КОНЕЦ)
	|			ГДЕ
	|				сжсвЗаболеванияПризнакиБолезни.Признак В(&ПризнакиБолезни)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Заболевания.Ссылка) КАК ВложенныйЗапрос
	|			ПО сжсвЗаболеванияПризнакиБолезни.Ссылка = ВложенныйЗапрос.Ссылка
	|		ПО (ВЫБОР
	|				КОГДА сжсвЗаболеванияПризнакиБолезни.Ссылка ЕСТЬ NULL 
	|					ТОГДА 1 = 1
	|				ИНАЧЕ сжсвЗаболеванияПризнакиБолезни.Ссылка = Заболевания.Ссылка
	|			КОНЕЦ)
	|ГДЕ
	|	сжсвЗаболеванияПризнакиБолезни.Признак В(&ПризнакиБолезни)
	|
	|СГРУППИРОВАТЬ ПО
	|	Заболевания.Ссылка,
	|	Заболевания.Наименование,
	|	сжсвЗаболеванияПризнакиБолезни.Признак,
	|	ВложенныйЗапрос.Признак
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	сжсвЗаболеванияПризнакиБолезни.Ссылка КАК Болезнь,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ сжсвЗаболеванияПризнакиБолезни.Признак) КАК КоличествоПризнаков
	|ПОМЕСТИТЬ Колпризн
	|ИЗ
	|	Основной КАК Основной
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Заболевания.ПризнакиБолезни КАК сжсвЗаболеванияПризнакиБолезни
	|		ПО Основной.Ссылка = сжсвЗаболеванияПризнакиБолезни.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	сжсвЗаболеванияПризнакиБолезни.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основной.Ссылка,
	|	Основной.Наименование,
	|	ВЫБОР
	|		КОГДА Колпризн.КоличествоПризнаков = 0
	|				ИЛИ Колпризн.КоличествоПризнаков ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ (Основной.КоличествоПодх / Колпризн.КоличествоПризнаков * 100)*(Колпризн.КоличествоПризнаков/&КоличествоПризнаков)
	|	КОНЕЦ КАК Процент
	|ИЗ
	|	Основной КАК Основной
	|		ЛЕВОЕ СОЕДИНЕНИЕ Колпризн КАК Колпризн
	|		ПО Основной.Ссылка = Колпризн.Болезнь
	|
	|СГРУППИРОВАТЬ ПО
	|	Основной.Ссылка,
	|	Основной.Наименование,
	|	ВЫБОР
	|		КОГДА Колпризн.КоличествоПризнаков = 0
	|				ИЛИ Колпризн.КоличествоПризнаков ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ (Основной.КоличествоПодх / Колпризн.КоличествоПризнаков * 100)*(Колпризн.КоличествоПризнаков/&КоличествоПризнаков)
	|	КОНЕЦ";	
	Запрос.УстановитьПараметр("ПризнакиБолезни",Параметры.ПризнакиБолезни);
	ЗАпрос.УстановитьПараметр("КоличествоПризнаков",Параметры.ПризнакиБолезни.Количество());
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаБолезней.Загрузить(РезультатЗапроса);

	
	//ДеревоИзЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

	//ЗначениеВРеквизитФормы(ДеревоИзЗапроса, "ДеревоБолезней");  
	КонецЕсли;



//    Для Каждого СтрокаДерева Из СтрокиДЗ Цикл

//        // Если мы в строке, у неё нет итогов, пропустим
//        Если СтрокаДерева.Строки.Количество() = 0 Тогда
//            Продолжить;
//        КонецЕсли;

//        СчитатьСуммыДЗ(СтрокаДерева.Строки);

//        // Для текущей записи вычислим сумму строк колонки
//        СтрокаДерева.ФактОстаток = СтрокаДерева.Строки.Итог("ФактОстаток");

//    КонецЦикла;

//// СчитатьСуммыДЗ()


//               // Добавляем новую колонку описанного типа
//    КолонкиВыборки.Добавить("ФактОстаток", ОписаниеЧисло, "Факт. остаток");

//    // Для того, чтобы были видны колонки, их надо создать
//    ЭлементыФормы.ТЗВыборка.СоздатьКолонки();

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//Если НЕ Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки = Неопределено тогда
	ВыбранноеНазначение = ВыбранныеЭлементы.Добавить();
	ВыбранноеНазначение.Ссылка = Элемент.ТекущиеДанные.Ссылка;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаБолезнейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//Если НЕ Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки = Неопределено тогда
	ВыбранноеНазначение = ВыбранныеЭлементы.Добавить();
	ВыбранноеНазначение.Ссылка = Элемент.ТекущиеДанные.Ссылка;
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьОтбора()
	
	Если УстановленОтбор Тогда
		Элементы.ФормаСнятьОтбор.Доступность = Истина;
	Иначе
		Элементы.ФормаСнятьОтбор.Доступность = Ложь;
		Элементы.ТаблицаБолезней.Видимость = Ложь;
		Элементы.Список.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтбор(Команда)
	
	Список.Отбор.Элементы.Очистить();
	УстановленОтбор = Ложь;
	УстановитьВидимостьОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	ОповеститьОВыборе(ВыбранныеЭлементы);
	 //Закрыть();
КонецПроцедуры

#КонецОбласти
